app/Controllers/AuthController.php

            $password = $this->request->getPost('password');

            $model = new UserModel();
            $user = $model->where('username', $username)->first();
---
SELECT *
FROM `users`
WHERE `username` = 'admin'
 LIMIT 1