app/Controllers/EmployeesController.php

    public function index()
    {
        helper('form');

        $model = new EmployeeModel();

        // Pagination config
        $perPage = 15;
        $page = $this->request->getVar('page') ?? 1;

        $employees = $model->paginate($perPage);
---
SELECT *
FROM `employees`
 LIMIT 15
SELECT COUNT(*) AS `numrows`
FROM `employees`

    public function edit($id = null)
    {
        $model = new EmployeeModel();

        helper('form');

        $employee = $model->find($id);
---
SELECT *
FROM `employees`
WHERE `employees`.`id` = '1'